# Ã–RNEK
import pandas as pd 
data = {
    "Name" : ["Ali", "AyÅŸe", "Mehmet", None],
    "Age" : [25,30,None,22],
    "Gender" : ["Male", "Female", "Mle", "Female"]
}
df = pd.DataFrame(data)

df["Gender"] = df["Gender"].replace("Mle", "Male") #hatalÄ± veri 
df["Age"]= df["Age"].fillna(df["Age"].mean()) # eksik yaÅŸ 
df = df.dropna(subset=["Name"]) #ismi eksik olanÄ± sil 
df

In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt 

#loading data
dataset = load_dataset("lukebarousse/data_jobs")
df = dataset["train"].to_pandas()

#data clenup
df["job_posted_date"] = pd.to_datetime(df["job_posted_date"])

/Users/haticekar/Desktop/anaconda/anaconda3/envs/python_course/lib/python3.11/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

### ðŸ“Œ Pandas ile En SÄ±k YapÄ±lan Data Cleaning Ä°ÅŸlemleri

| Ä°ÅŸlem                        | AÃ§Ä±klama                                           | Pandas Ã–rnek Kodu                                  |
|-----------------------------|----------------------------------------------------|----------------------------------------------------|
| Eksik verileri bulma        | NaN veya boÅŸ deÄŸerleri tespit etme                 | `df.isnull().sum()`                                |
| Eksik verileri temizleme    | Eksik verileri silme veya doldurma                 | `df.dropna()` / `df.fillna(0)`                     |
| Veri tipi dÃ¶nÃ¼ÅŸtÃ¼rme        | `str`, `int`, `datetime` gibi tip dÃ¶nÃ¼ÅŸÃ¼mleri      | `df['date'] = pd.to_datetime(df['date'])`          |
| Ã‡ift kayÄ±tlarÄ± silme        | AynÄ± satÄ±rdan birden fazla varsa temizleme         | `df.drop_duplicates()`                             |
| HatalÄ± verileri dÃ¼zeltme    | YanlÄ±ÅŸ girilmiÅŸ verileri doÄŸru olanla deÄŸiÅŸtirme   | `df['gender'].replace('Mle', 'Male')`              |
| Gereksiz sÃ¼tun/satÄ±r silme  | Analize dahil edilmeyecek sÃ¼tun veya satÄ±rlarÄ± atma| `df.drop(['Unnamed: 0'], axis=1)`                  |
| Metin verileri temizleme    | BoÅŸluklarÄ± silme, kÃ¼Ã§Ã¼k/bÃ¼yÃ¼k harf dÃ¼zeni          | `df['name'] = df['name'].str.strip().str.lower()`  |
| AykÄ±rÄ± deÄŸerleri filtreleme | Ã‡ok uÃ§ta olan istatistiksel deÄŸerleri temizleme    | `df[df['salary'] < 300000]`                        |

In [2]:
df["salary_year_avg"].median()

115000.0

In [3]:
df["salary_hour_avg"].median()

45.97999954223633

# Handling Missing Data
#### Notes
- `df.dropna()`: Drop missing values.
##### Examples
Here we are only drop values if all of their values are missing.

In [17]:
df_cleaned = df.dropna(how="all")
df_cleaned.info() #her sÃ¼tundaki eksik (non-null ) veri sayÄ±sÄ±nÄ± ve veri tiplerini 
#how='all': Sadece tÃ¼m sÃ¼tunlarÄ± NaN olan satÄ±rlarÄ± sil.
#Alternatif olarak how='any' deseydin, herhangi bir hÃ¼cre NaN ise o satÄ±r silinirdi (daha agresif temizlik olurdu).

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        22003 non-null   float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

Right now all we can do is drop values if they're missing. But that's not useful right now because our DataFrame didn't have any. 

So, what if we wanted to fill the missing values with something else? This is expecially useful so we don't run into errors when dealing with NaN values.

### Fillna

#### Notes

- `df.fillna()`: Fill missing values

#### Examples

Let's fill in instances where there's no salary info (aka these columns have NaN values `salary_rate`, `salary_year_avg`, `salary_hour_avg`) with 0.

In [18]:
df_cleaned.iloc[:10, 11:14]

  salary_rate  salary_year_avg  salary_hour_avg
0        None              NaN              NaN
1        None              NaN              NaN
2        None              NaN              NaN
3        None              NaN              NaN
4        None              NaN              NaN
5        None              NaN              NaN
6        None              NaN              NaN
7        None              NaN              NaN
8        None              NaN              NaN
9        None              NaN              NaN

In [ ]:
fill_values = ["salary_rate", "salary_year_avg","salary_hour_avg"] #sadece bir liste  df_cleaned -> boÅŸ satÄ±rlarÄ± sildiÄŸimi< veri seti 
df_filled = df_cleaned.fillna(0) # eksik olan deÄŸerleri 0 ile doldurur.
df_filled.info() #KaÃ§ satÄ±dr ve sÃ¼tun var? -Hangi sÃ¼tunda kaÃ§ null olmayan deÄŸer (non-null) var?-Her sÃ¼tunun tipi (int, float, object vs.)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785741 non-null  object
 2   job_location           785741 non-null  object
 3   job_via                785741 non-null  object
 4   job_schedule_type      785741 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785741 non-null  object
 11  salary_rate            785741 non-null  object
 12  salary_year_avg        785741 non-null  float64
 13  salary_hour_avg        785741 non-null  float64
 14  company_name           785741 non-null  object
 15  job_skills             785741 non-null  object
 16  job_type_skills        785741 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

In [25]:
df_filled.iloc[:10, 11:14]

  salary_rate  salary_year_avg  salary_hour_avg
0           0              0.0              0.0
1           0              0.0              0.0
2           0              0.0              0.0
3           0              0.0              0.0
4           0              0.0              0.0
5           0              0.0              0.0
6           0              0.0              0.0
7           0              0.0              0.0
8           0              0.0              0.0
9           0              0.0              0.0

## Drop Duplicates

### Notes

* `drop_duplicates()`: Remove duplicate rows.
* Analysts will often need to clean up data and one of the most common issues we run into is duplicate values. 

### Examples

Now that we've dealt with NaN values. Let's continue cleaning the data by removing any duplicate rows.

In [ ]:
df_unique = df_filled.drop_duplicates()
df_unique.info()

#drop_duplicates() fonksiyonu, aynÄ± satÄ±rdan birden fazla varsa (yani birebir aynÄ± deÄŸerler tÃ¼m sÃ¼tunlarda varsa) bu tekrarlÄ± satÄ±rlarÄ± siler.
#Sadece ilk gÃ¶rÃ¼len satÄ±rÄ± tutar, diÄŸerlerini siler.
#Veri temizliÄŸinde Ã§ok kullanÄ±lÄ±r Ã§Ã¼nkÃ¼ bazÄ± veriler yanlÄ±ÅŸlÄ±kla birden fazla defa kaydedilmiÅŸ olabilir.

<class 'pandas.core.frame.DataFrame'>
Index: 785640 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785640 non-null  object
 1   job_title              785640 non-null  object
 2   job_location           785640 non-null  object
 3   job_via                785640 non-null  object
 4   job_schedule_type      785640 non-null  object
 5   job_work_from_home     785640 non-null  bool
 6   search_location        785640 non-null  object
 7   job_posted_date        785640 non-null  datetime64[ns]
 8   job_no_degree_mention  785640 non-null  bool
 9   job_health_insurance   785640 non-null  bool
 10  job_country            785640 non-null  object
 11  salary_rate            785640 non-null  object
 12  salary_year_avg        785640 non-null  float64
 13  salary_hour_avg        785640 non-null  float64
 14  company_name           785640 non-null  object
 15  job_skills             785640 non-null  object
 16  job_type_skills        785640 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 92.2+ MB

If you compare that with the original DataFrame which had 787686 entries. This new DataFrame `df_unique` has 787577 entries. It removed 109 entries. 

Now let's see what would happen if we tried to remove duplicates from `job_title`.

In [ ]:
df_unique = df_filled.drop_duplicates(subset=["job_title"]) #burada job_title a bakÄ±yor daha sonra aynÄ± job_title a sahip olan bÃ¼tÃ¼n satÄ±rlarÄ± siliyor 
df_unique.info()

<class 'pandas.core.frame.DataFrame'>
Index: 234674 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        234674 non-null  object
 1   job_title              234674 non-null  object
 2   job_location           234674 non-null  object
 3   job_via                234674 non-null  object
 4   job_schedule_type      234674 non-null  object
 5   job_work_from_home     234674 non-null  bool
 6   search_location        234674 non-null  object
 7   job_posted_date        234674 non-null  datetime64[ns]
 8   job_no_degree_mention  234674 non-null  bool
 9   job_health_insurance   234674 non-null  bool
 10  job_country            234674 non-null  object
 11  salary_rate            234674 non-null  object
 12  salary_year_avg        234674 non-null  float64
 13  salary_hour_avg        234674 non-null  float64
 14  company_name           234674 non-null  object
 15  job_skills             234674 non-null  object
 16  job_type_skills        234674 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 27.5+ MB

 # drop_duplicates() â€“ TÃ¼m satÄ±rlar aynÄ± olanlarÄ± siler- subset["job_title""]
| job_title    | salary | location |
|--------------|--------|----------|
| Data Analyst | 100000 | US       |
| Data Analyst | 100000 | US       |
| Data Analyst | 120000 | US       |
| Data Eng.    | 110000 | Canada   |

# drop_duplicates() sonrasÄ±
| job_title    | salary | location |
|--------------|--------|----------|
| Data Analyst | 100000 | US       |
| Data Analyst | 120000 | US       |
| Data Eng.    | 110000 | Canada   |

In [32]:
df_unique.head(10)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,0,0.0,0.0,Boehringer Ingelheim,0,0
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee MÃ©xico,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,0,0.0,0.0,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,0,0.0,0.0,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,0,0.0,0.0,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,0,0.0,0.0,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."
5,Data Engineer,GCP Data Engineer,Anywhere,via ZipRecruiter,Contractor and Temp work,True,Georgia,2023-11-07 14:01:59,False,False,United States,0,0.0,0.0,smart folks inc,"['python', 'sql', 'gcp']","{'cloud': ['gcp'], 'programming': ['python', '..."
6,Senior Data Engineer,Senior Data Engineer - GCP Cloud,"Dearborn, MI",via LinkedIn,Full-time,False,"Florida, United States",2023-03-27 13:18:18,False,False,United States,0,0.0,0.0,"Miracle Software Systems, Inc","['sql', 'python', 'java', 'sql server', 'gcp',...","{'cloud': ['gcp', 'bigquery'], 'databases': ['..."
7,Data Engineer,Data Engineer,Anywhere,via LinkedIn,Full-time,True,Romania,2023-12-07 13:40:49,False,False,Romania,0,0.0,0.0,Zitec,"['sql', 'nosql', 'gcp', 'azure', 'aws', 'bigqu...","{'cloud': ['gcp', 'azure', 'aws', 'bigquery', ..."
8,Business Analyst,Technology & Operations Business Analyst,"Copenhagen, Denmark",via Trabajo.org,Full-time,False,Denmark,2023-06-05 13:44:34,False,False,Denmark,0,0.0,0.0,Hempel,"['excel', 'powerpoint', 'power bi']","{'analyst_tools': ['excel', 'powerpoint', 'pow..."
9,Data Scientist,Data Scientist II,Anywhere,via ZipRecruiter,Full-time,True,"New York, United States",2023-04-23 13:02:57,False,False,United States,0,0.0,0.0,"Radwell International, LLC","['sql', 'python', 'r', 'mongodb', 'mongodb', '...","{'analyst_tools': ['excel'], 'cloud': ['azure'..."

In [36]:
print("Length of original df: ", len(df_filled))
print("Length of drop duplicates: ", len(df_unique))
print("Rows Dropped: ", len(df_filled)-len(df_unique))

Length of original df:  785741
Length of drop duplicates:  234674
Rows Dropped:  551067

In [37]:
df

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee MÃ©xico,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785736,Software Engineer,DevOps Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,None,NaN,NaN,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,CRM Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,NaN,NaN,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,NaN,NaN,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Principal Associate, Data Engineer (Remote-Eli...","Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,None,NaN,NaN,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,NaN,NaN,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

## .fillna()
### AnlamÄ±:
* Eksik (NaN, boÅŸ) deÄŸerleri doldurmak iÃ§in kullanÄ±lÄ±r.
### Ne iÅŸe yarar?
* Veri setinde eksik deÄŸerler varsa, bunlarÄ± bir deÄŸerle (0, ortalama, "bilinmiyor" gibi) otomatik doldurur.
### Neden Ã¶nemli?
* Eksik veriler, analizleri ve modellemeleri bozar. Ã–nce doldurmazsak iÅŸlemler hata verebilir.


1. pandas.DataFrame.fillna
DataFrame.fillna(value=None, *, method=None, axis=None, inplace=False, limit=None, downcast=<no_default>)[source]

## .drop_duplicates()
### AnlamÄ±:
* Veri setindeki tekrar eden (aynÄ±) satÄ±rlarÄ± silmek iÃ§in kullanÄ±lÄ±r.
### Ne iÅŸe yarar?
* EÄŸer aynÄ± veri birden fazla kez varsa, sadece bir tanesini tutar, diÄŸer kopyalarÄ± kaldÄ±rÄ±r.
### Neden Ã¶nemli?
* AynÄ± verilerin birden fazla olmasÄ± analiz sonuÃ§larÄ±nÄ± yanlÄ±ÅŸ yapar. Bu yÃ¼zden tekrarlarÄ± temizleriz.

1. DataFrame.drop_duplicates(subset=None, *, keep='first', inplace=False, ignore_index=False)[source]